# Elements Of Data Processing (2021S1) - Week 1

### Welcome:
- Tutor: Akira
- Times: Thurs 7pm, Fri 3:15pm

I strongly recommend you go through the Revision notebooks I have created. It's actually more of a "learning" rather than "revising" experience...

### Getting Started with Jupyter Notebook
Jupyter notebook is an extremely useful tool for developing and presenting projects (particularly in python).  You can include code segments and view their output directly in your browser.  You can also add rich text, visualisations, equations and more.

The difference between this and Grok (from COMP10001) is that you can run your code line by line (without having to run all of your code at once for an output).

### Cells
Jupyter notebook contains two main types of cells:
- Markdown cells: These can be used to contain text, equations and other non-code items.  The cell that you're reading right now is a markdown cell.  You can use [Markdown](https://www.markdownguide.org/) to format your text.  If you prefer, you can also format your text using <b>HTML</b>.  Clicking the **Run** button will format and display your text.
- Code cells: These contain code segments that can be executed individually.  When executed, the output of the code will be displayed below the code cell.

### General Tips for Jupyter Notebook
Cell Running shortcuts:
- `shift + enter` : Run current cell - keyboard shortcut for the <button class='btn btn-default btn-xs'><i class="fa-play fa"></i><span class="toolbar-btn-label">Run</span></button> button
- `ctrl + enter` : Run selected cells

Command mode (press `esc` to enter):
- Enter command mode pressing `esc` (blue highlight)
- `a` to create a cell **above**
- `b` to create a cell **below**
- `dd` (double d) to **delete** a cell
- `m` to make the cell render in **markdown**
- `r` to make the cell render in **raw** text
- `y` to make the cell render python code
- `enter` to "edit" the cell

Code Shortcuts:
- `shift + tab` : brings function/method arguments up

Magic Cells:
```bash
%%time # times the cell execution
%%bash # allows bash commands (or cmd) to be run
%%html # renders html syntax
%%writefile script.py # outputs the lines of code into a script of choice
%run script.py # runs a script of choice
%run -i script.py # runs a script of choice and adds all variables to the notebooks' namespace
```

### Pandas
- One of the most useful and common library for Data Engineers, Data Scientists, and Data Analysts.
- Much more powerful for reading data in (in contrast to the `csv` library and `open()`).
- Introduces a few new data structures, most commonly the `DataFrame()` which is the equivalent to your Excel Spreadsheet or Database table (however you want to view it)

In [1]:
# we rename the library to pd - it's just the common practice (unless you want to retype pandas every time)
import pandas as pd

# this is a nice way of displaying series and dataframes (use instead of print)
from IPython.display import display

### Series
- The first of the new data structures
- It's a 1D array-like object containing the data and an associated array of data labels called index.
- This is an index to value relationship (like a `list()` in Python)

<img src="images/series1.jpg">

To create a Series:
- `s = Series(data, index=index)`


Where:
- `data` is a list/array and `index` is a list/array (by default, it increments from 0)
- OR `data` is a dictionary where `index` is obtained through `keys` and `data` from `values`

### Creating a Series

In [2]:
data = [4,3,-5,9,1,7]

pd.Series(data)

0    4
1    3
2   -5
3    9
4    1
5    7
dtype: int64

In [3]:
data = [4,3,-5,9,1,7]
index = range(100, 106)

s = pd.Series(data, index)

In [4]:
# Retrieve the values of the series
display(s.values)

# Retrieve the indicies
display(s.index)

# Re-define the indicies
new_index = range(-99, -93)
s.index = new_index
display(s)

array([ 4,  3, -5,  9,  1,  7])

RangeIndex(start=100, stop=106, step=1)

-99    4
-98    3
-97   -5
-96    9
-95    1
-94    7
dtype: int64

If we want to use a dictionary to create a series (and later `JSON`)...

In [5]:
data = {'1990':15.45288167, '2000':17.20060983, '2007':17.86526004,
                '2008':18.16087566,'2009':18.20018196,'2010':16.92095367,
                '2011':16.86260095, '2012':16.51938578, '2013':16.34730205}

s = pd.Series(data)

s

1990    15.452882
2000    17.200610
2007    17.865260
2008    18.160876
2009    18.200182
2010    16.920954
2011    16.862601
2012    16.519386
2013    16.347302
dtype: float64

### Slicing
- Like lists and strings in COMP10001, Series and Dataframes can be sliced.
- Equivalent of `SELECT * FROM columns WHERE condition` for Databases
- `.loc[]` for *locating* matching values
- `.iloc[]` for *index locating* matching values according to an index (highly not recommended at all unless you are subsampling)

### `.loc`
Syntax: `df.loc[df[col] > value]`

In [6]:
print("Original:")
display(s)

# sliced data for all values greater than 17
print("Sliced using loc:")
display(s.loc[s > 17])

Original:

1990    15.452882
2000    17.200610
2007    17.865260
2008    18.160876
2009    18.200182
2010    16.920954
2011    16.862601
2012    16.519386
2013    16.347302
dtype: float64

Sliced using loc:

2000    17.200610
2007    17.865260
2008    18.160876
2009    18.200182
dtype: float64

### Series Operations
- You can apply operations depending on the data type
- (Advanced) You can apply functions on columns

In [7]:
double_s = s * 2
display(double_s)

1990    30.905763
2000    34.401220
2007    35.730520
2008    36.321751
2009    36.400364
2010    33.841907
2011    33.725202
2012    33.038772
2013    32.694604
dtype: float64

### Series methods
- Take the mean
- Redefine the column or index name

In [8]:
s.mean(), s.std()

(17.05889462333333, 0.9097717898280104)

In [9]:
# a one-in-all method of statistically describing the dataset
# includes count (number of rows), mean, standard deviation, min value, max value, quartiles
s.describe()

count     9.000000
mean     17.058895
std       0.909772
min      15.452882
25%      16.519386
50%      16.920954
75%      17.865260
max      18.200182
dtype: float64

In [10]:
s.name = 'CO2 Emissions'
s.index.name = 'Year'

s

Year
1990    15.452882
2000    17.200610
2007    17.865260
2008    18.160876
2009    18.200182
2010    16.920954
2011    16.862601
2012    16.519386
2013    16.347302
Name: CO2 Emissions, dtype: float64

### <span style="color:blue"> Series Exercise 1 (Together) </span>

Find:
- The max, median, and cumulative sum between 1960 and 2013.
- The CO2 Emissions in Australia between 2000 to 2010
- Given the population of Australia in 2013 was 23117353, find the CO2 emission per capita (divide emissions by population)

In [39]:
### answer here
display(s.max())
display(s.median())
display(s.cumsum())
display(s['2000':'2010'])
display(s['2013']/23117353)

18.20018196

16.92095367

Year
1990     15.452882
2000     32.653492
2007     50.518752
2008     68.679627
2009     86.879809
2010    103.800763
2011    120.663364
2012    137.182750
2013    153.530052
Name: CO2 Emissions, dtype: float64

Year
2000    17.200610
2007    17.865260
2008    18.160876
2009    18.200182
2010    16.920954
Name: CO2 Emissions, dtype: float64

7.071441981268357e-07

### DataFrames
- Dataframes are a tabular data structure which contain multiple rows and columns (like your spreadsheets or tables)
- One of the most important data structures when working with any dataset
- Same as series in a sense that it has both rows and column indicies.
- Each "row index" corresponds to the "row of values" (column values)
- We usually name our dataframes `df_something` 
- Columns are indexed much like dictionary keys $\rightarrow$ `df[column name]`


<img src="images/DF.jpg">

In [11]:
population_data = {'1990':17065100, '2000':19153000, '2007':20827600,
        '2008':21249200,'2009':21691700,'2010':22031750,
        '2011':22340024, '2012':22728254, '2013':23117353}

population = pd.Series(population_data)
display(population)

emission_data = {'1990':15.45288167, '2000':17.20060983, '2007':17.86526004,
                '2008':18.16087566,'2009':18.20018196,'2010':16.92095367,
                '2011':16.86260095, '2012':16.51938578, '2013':16.34730205}
emission = pd.Series(emission_data)
display(emission)

1990    17065100
2000    19153000
2007    20827600
2008    21249200
2009    21691700
2010    22031750
2011    22340024
2012    22728254
2013    23117353
dtype: int64

1990    15.452882
2000    17.200610
2007    17.865260
2008    18.160876
2009    18.200182
2010    16.920954
2011    16.862601
2012    16.519386
2013    16.347302
dtype: float64

In [15]:
df = pd.DataFrame({"Emmision": emission, "Population": population})
df

       Emmision  Population
1990  15.452882    17065100
2000  17.200610    19153000
2007  17.865260    20827600
2008  18.160876    21249200
2009  18.200182    21691700
2010  16.920954    22031750
2011  16.862601    22340024
2012  16.519386    22728254
2013  16.347302    23117353

### Reading in CSV's 
- As easy as `pd.read_csv(filename)`
- Optional arguments (i.e `encoding`, `astype`, etc...)
- Documentation: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [16]:
countries = pd.read_csv("data/countries.csv", encoding='ISO-8859-1')
countries

                   Country                      Region          IncomeGroup
0              Afghanistan                  South Asia           Low income
1                  Albania       Europe & Central Asia  Upper middle income
2                  Algeria  Middle East & North Africa  Upper middle income
3           American Samoa         East Asia & Pacific  Upper middle income
4                  Andorra       Europe & Central Asia          High income
..                     ...                         ...                  ...
212  Virgin Islands (U.S.)   Latin America & Caribbean          High income
213     West Bank and Gaza  Middle East & North Africa  Lower middle income
214            Yemen, Rep.  Middle East & North Africa  Lower middle income
215                 Zambia          Sub-Saharan Africa  Lower middle income
216               Zimbabwe          Sub-Saharan Africa           Low income

[217 rows x 3 columns]

In [17]:
# we can view the first/last n elements using .head(n) or .tail(n)
# by default, n = 5

display(df.head())
display(df.tail())
display(df.head(10))

       Emmision  Population
1990  15.452882    17065100
2000  17.200610    19153000
2007  17.865260    20827600
2008  18.160876    21249200
2009  18.200182    21691700

       Emmision  Population
2009  18.200182    21691700
2010  16.920954    22031750
2011  16.862601    22340024
2012  16.519386    22728254
2013  16.347302    23117353

       Emmision  Population
1990  15.452882    17065100
2000  17.200610    19153000
2007  17.865260    20827600
2008  18.160876    21249200
2009  18.200182    21691700
2010  16.920954    22031750
2011  16.862601    22340024
2012  16.519386    22728254
2013  16.347302    23117353

### Dataframe methods
Plenty to go around. Most useful ones of note are:
- `df[column name].value_counts()`
- `df.groupby(column name or column names as an iterable)`
- `df.apply(some function)`
- `df.sort_values(by=column name or column names as an iterable)`
- `df.map(dictionary specifying value to new value)`
- `df.update(newer version of the dataframe)` 
- `df.reset_index(drop=True for remove index or False for keep index)`
- `df.fillna(value)`

View more details in the documentation: https://pandas.pydata.org/pandas-docs/stable/reference/frame.html

You'll notice the documentation and stack overflow will be your best friends in this subject.

In [18]:
df.value_counts('Emission')

KeyError: 'Emission'

Note how "Emmision" has a typo (should be "Emission"). We can `rename` it!
- `df.rename({original name: desired name}, axis=1, inplace=True)`
- `.rename()` requires a dictionary of originan name to new name
- `axis=1` specifies that we want to change the "column names" (`axis=0` is for the index names)
- `inplace=True` specifies if we want to mutate the original dataframe (like `list.sort()`) or if we want a renamed version of the dataframe returned (like `sorted(list)`)

In [19]:
df.rename({"Emmision": "Emission"}, axis=1, inplace=True)
df

       Emission  Population
1990  15.452882    17065100
2000  17.200610    19153000
2007  17.865260    20827600
2008  18.160876    21249200
2009  18.200182    21691700
2010  16.920954    22031750
2011  16.862601    22340024
2012  16.519386    22728254
2013  16.347302    23117353

In [20]:
df['Emission'].value_counts()

17.865260    1
15.452882    1
16.862601    1
16.519386    1
17.200610    1
16.347302    1
18.160876    1
18.200182    1
16.920954    1
Name: Emission, dtype: int64

In [21]:
# create a new DataFrame for the CO2 emission from a csv file
df2 = pd.read_csv('data/emission.csv', encoding='ISO-8859-1')
df2.tail()

,Country,1990,2000,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
212,Virgin Islands (U.S.),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
213,West Bank and Gaza,NaN,0.271058,0.665297,0.570947,0.564578,0.534015,0.572407,0.543675,0.584855,NaN,NaN,NaN
214,"Yemen, Rep.",0.802312,0.822618,0.966383,1.000747,1.070024,0.993225,0.811478,0.735086,0.992680,NaN,NaN,NaN
215,Zambia,0.300362,0.172174,0.139614,0.166369,0.187044,0.194713,0.204524,0.235347,0.250863,NaN,NaN,NaN
216,Zimbabwe,1.478723,1.113890,0.743449,0.575777,0.607470,0.663130,0.815684,0.887956,0.924990,NaN,NaN,NaN

Take a moment to notice `NaN` (Not a Number). 
- This is the equivalent of `None` and implies the data is missing.
- The thing with `NaN` is that it evaluates to `True` and has type `float` which can be annoying. 
- To do comparisions with it, you should aim to use `np.NaN` (`np` is the `numpy` library).

### Subsets (and how to do it correctly)
- Subsets can be created by taking a column, slice or variation of the dataframe

In [22]:
df_2010 = df2['2010']
df_2010

0      0.302936
1      1.578574
2      3.307164
3           NaN
4      6.124770
         ...
212         NaN
213    0.534015
214    0.993225
215    0.194713
216    0.663130
Name: 2010, Length: 217, dtype: float64

However, this is a "shallow" copy. 
- For those of you who have done COMP10002, this is the equivalent of creating a pointer to point to the subset. This implies that if you change the original data, then the pointer will also take those changes on board
- For those of you who haven't, a shallow copy is essentially saying `df_2010` is equal to whatever `df2['2010']` is at all times. If I then change `df['2010']` to have different values, `df_2010` will then be equal to the new values too.

You don't always want this property (and it causes several logic errors in code).
- If you want to maintain an unchanged version of a subset, use `.copy()`

Here's an example of it:

In [23]:
import numpy as np

df2['2010'] = df2['2010'].apply(lambda x: x + 99 if x != np.NaN else -1)
df_2010

0       99.302936
1      100.578574
2      102.307164
3             NaN
4      105.124770
          ...
212           NaN
213     99.534015
214     99.993225
215     99.194713
216     99.663130
Name: 2010, Length: 217, dtype: float64

As you can see, we changed `df2`, but the changes were also reflected in `df_2010`. Let's try this again...

In [24]:
# recreate a new DataFrame for the CO2 emission from a csv file
df2 = pd.read_csv('data/emission.csv', encoding='ISO-8859-1')
df2.tail()

,Country,1990,2000,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
212,Virgin Islands (U.S.),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
213,West Bank and Gaza,NaN,0.271058,0.665297,0.570947,0.564578,0.534015,0.572407,0.543675,0.584855,NaN,NaN,NaN
214,"Yemen, Rep.",0.802312,0.822618,0.966383,1.000747,1.070024,0.993225,0.811478,0.735086,0.992680,NaN,NaN,NaN
215,Zambia,0.300362,0.172174,0.139614,0.166369,0.187044,0.194713,0.204524,0.235347,0.250863,NaN,NaN,NaN
216,Zimbabwe,1.478723,1.113890,0.743449,0.575777,0.607470,0.663130,0.815684,0.887956,0.924990,NaN,NaN,NaN

In [25]:
df_2010 = df2['2010'].copy()
df_2010

0      0.302936
1      1.578574
2      3.307164
3           NaN
4      6.124770
         ...
212         NaN
213    0.534015
214    0.993225
215    0.194713
216    0.663130
Name: 2010, Length: 217, dtype: float64

In [26]:
df2['2010'] = df2['2010'].apply(lambda x: x + 99 if x != np.NaN else -1)
df_2010

0      0.302936
1      1.578574
2      3.307164
3           NaN
4      6.124770
         ...
212         NaN
213    0.534015
214    0.993225
215    0.194713
216    0.663130
Name: 2010, Length: 217, dtype: float64

Now it's unchanged!

### Basic Sorting Operations

In [27]:
# Sort column values using sort_values 
df_2010.sort_values()

31     0.022480
44     0.030197
38     0.043463
161    0.057354
37     0.059398
         ...
171         NaN
177         NaN
182         NaN
201         NaN
212         NaN
Name: 2010, Length: 217, dtype: float64

In [28]:
# Sort column values to find the top countries
df_2010.sort_values(ascending = False)

158    41.131162
196    36.073741
105    29.294309
9      24.182702
14     23.101200
         ...
171          NaN
177          NaN
182          NaN
201          NaN
212          NaN
Name: 2010, Length: 217, dtype: float64

### Advanced Sort Operations

In [29]:
# Sort column values of a DataFrame
sorted_2012 = df2.sort_values(by='2012', ascending = False)
sorted_2012

,Country,1990,2000,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
158,Qatar,24.712027,58.522169,53.672746,46.684906,43.504331,140.131162,42.213752,46.697477,40.462355,NaN,NaN,NaN
50,Curacao,NaN,NaN,NaN,NaN,NaN,NaN,NaN,39.638551,34.161635,NaN,NaN,NaN
196,Trinidad and Tobago,13.879875,18.844281,36.816763,35.455298,33.952984,135.073741,35.137310,33.819694,34.520237,NaN,NaN,NaN
105,Kuwait,23.466084,27.759023,29.636849,30.581264,30.300789,128.294309,28.102662,29.578729,27.258964,NaN,NaN,NaN
28,Brunei Darussalam,24.105188,14.255144,22.474463,23.950011,20.311171,119.856947,24.272670,23.800884,18.918736,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
157,Puerto Rico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
163,San Marino,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
182,St. Martin (French part),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
201,Tuvalu,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
212,Virgin Islands (U.S.),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [30]:
# Sort column values using two columns
sorted_2012 = df2.sort_values(by=['2012','2013'], ascending=[False, True])
sorted_2012

,Country,1990,2000,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
158,Qatar,24.712027,58.522169,53.672746,46.684906,43.504331,140.131162,42.213752,46.697477,40.462355,NaN,NaN,NaN
50,Curacao,NaN,NaN,NaN,NaN,NaN,NaN,NaN,39.638551,34.161635,NaN,NaN,NaN
196,Trinidad and Tobago,13.879875,18.844281,36.816763,35.455298,33.952984,135.073741,35.137310,33.819694,34.520237,NaN,NaN,NaN
105,Kuwait,23.466084,27.759023,29.636849,30.581264,30.300789,128.294309,28.102662,29.578729,27.258964,NaN,NaN,NaN
28,Brunei Darussalam,24.105188,14.255144,22.474463,23.950011,20.311171,119.856947,24.272670,23.800884,18.918736,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
157,Puerto Rico,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
163,San Marino,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
182,St. Martin (French part),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
201,Tuvalu,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
212,Virgin Islands (U.S.),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Slicing using the `.loc` and `.iloc` method
- Like Series, you can slice your dataframes
- Recall `.iloc` for indicies, `.loc` based on conditions.

The full syntax is as follows (some examples):
- `df.loc[df['2012'] > 40, '2013']`: Give me all the `'2013'` row values if the row in `'2012'` was greater than 40.
- `df.loc[df['2012'] > 40, ['2012','2013']]`: Give me all the row values fpr `'2012'` and `'2013'` if the row in `'2012'` was greater than 40.

You can also use `.loc` for specific indicies (but once again, not recommended unless you are taking the top `n` values of something)

**Note:** `.loc[]` includes the value you want to slice (inclusive)
i.e `.loc[:5]` will return indicies 0 to 5 (6 values)

In [31]:
display(df2.loc[df2['2012'] > 40, '2013'])
display(df2.loc[df2['2012'] > 40, ['2012','2013']])

158    40.462355
Name: 2013, dtype: float64

          2012       2013
158  46.697477  40.462355

In [32]:
df2.loc[[3,5], ['Country','1990']]

          Country      1990
3  American Samoa       NaN
5          Angola  0.459698

In [33]:
# All rows and specific columns
df2.loc[:,['Country','1990']]

# or alternatively just use df2[['Country','1990']]

                   Country      1990
0              Afghanistan  0.216661
1                  Albania  1.615624
2                  Algeria  3.007911
3           American Samoa       NaN
4                  Andorra       NaN
..                     ...       ...
212  Virgin Islands (U.S.)       NaN
213     West Bank and Gaza       NaN
214            Yemen, Rep.  0.802312
215                 Zambia  0.300362
216               Zimbabwe  1.478723

[217 rows x 2 columns]

### <span style="color:blue"> Dataframe Exercise 1 </span>

- Retrieve the mean, median of CO2 emission generated in 2012 by all countries.
- Retrieve the top 5 countries with the most CO2 emission in 2012. How about the 5 countries with the least emission? (remember that `.sort_values()` has an **ascending** parameter that is set to `True` by default).
- Retrieve the sum of CO2 emission for all years and find the 2 years with the maximum CO2 emission.

In [44]:
##answer here
display(df2['2012'].mean())
display(df2.sort_values(by='2012', ascending=False).head(5)['Country'])
display(df2[df2.columns[1:]].sum())
display(df2[df2.columns[1:]].sum().sort_values(ascending=False).head(2))

5.161476912617647

158                  Qatar
50                 Curacao
196    Trinidad and Tobago
105                 Kuwait
28       Brunei Darussalam
Name: Country, dtype: object

1990      734.237693
2000      936.682642
2007     1025.977262
2008     1023.528475
2009      975.062049
2010    21008.472087
2011      998.017767
2012     1052.941290
2013     1024.685643
2014        0.000000
2015        0.000000
2016        0.000000
dtype: float64

2010    21008.472087
2012     1052.941290
dtype: float64

### <span style="color:blue"> Dataframe Exercise 2 </span>

Create a dataframe that has `Country`, `Region` and `IncomeGroup` of the top 10 emitting countries in 2012.
- `countries` and `df2` are the variables
- several ways of getting to the solution

In [66]:
##answer here

# Database systems: Using a Left Join operation
# SELECT Country, Region, IncomeGroup FROM df2 LEFT JOIN countries ON Country ORDER BY df2.2012
display(
    df2.sort_values(by='2012', ascending=False).head(10).merge(
        countries, on='Country', how='left'
    )[['Country','Region','IncomeGroup']]
)

# eodp method
top10 = df2.sort_values(by='2012', ascending=False).head(10)['Country'].values
display(
    countries.loc[countries['Country'].isin(top10)]
)

                     Country                      Region  IncomeGroup
0                      Qatar  Middle East & North Africa  High income
1                    Curacao   Latin America & Caribbean  High income
2        Trinidad and Tobago   Latin America & Caribbean  High income
3                     Kuwait  Middle East & North Africa  High income
4          Brunei Darussalam         East Asia & Pacific  High income
5                    Bahrain  Middle East & North Africa  High income
6  Sint Maarten (Dutch part)   Latin America & Caribbean  High income
7                 Luxembourg       Europe & Central Asia  High income
8       United Arab Emirates  Middle East & North Africa  High income
9               Saudi Arabia  Middle East & North Africa  High income

                       Country                      Region  IncomeGroup
14                     Bahrain  Middle East & North Africa  High income
28           Brunei Darussalam         East Asia & Pacific  High income
50                     Curacao   Latin America & Caribbean  High income
105                     Kuwait  Middle East & North Africa  High income
115                 Luxembourg       Europe & Central Asia  High income
158                      Qatar  Middle East & North Africa  High income
164               Saudi Arabia  Middle East & North Africa  High income
171  Sint Maarten (Dutch part)   Latin America & Caribbean  High income
196        Trinidad and Tobago   Latin America & Caribbean  High income
204       United Arab Emirates  Middle East & North Africa  High income

## Groupby
- The Groupby method lets you separate the data into different groups based off shared characteristics.  
- For example, we can group countries by region or income range and then analyse those groups individually. 
- `groupby` objects are like your generator functions (list comprehension) and require an "aggregation" to give an output
- Alternatively, if you just want the groupby, you can reset the index.

<img src="files/images/groupby1.jpg">

Documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html

Here's an example

In [36]:
countries.groupby('IncomeGroup').count()

                     Country  Region
IncomeGroup
High income               78      78
Low income                31      31
Lower middle income       52      52
Upper middle income       56      56

In [37]:
countries.groupby('IncomeGroup').count().reset_index()

           IncomeGroup  Country  Region
0          High income       78      78
1           Low income       31      31
2  Lower middle income       52      52
3  Upper middle income       56      56

### <span style="color:blue"> Exercise 3 </span>

Using Countries data frame, group the rows using the Region column.
* Show the size of each group
* Find the number of high income and low income countries by region

In [73]:
##answer here
display(countries.groupby('Region').size().reset_index())
display(countries.loc[countries['IncomeGroup'].isin(['High income', 'Low income'])].groupby(['Region', 'IncomeGroup']).count())

                       Region   0
0         East Asia & Pacific  37
1       Europe & Central Asia  58
2   Latin America & Caribbean  42
3  Middle East & North Africa  21
4               North America   3
5                  South Asia   8
6          Sub-Saharan Africa  48

                                        Country
Region                     IncomeGroup
East Asia & Pacific        High income       13
                           Low income         1
Europe & Central Asia      High income       37
Latin America & Caribbean  High income       16
                           Low income         1
Middle East & North Africa High income        8
North America              High income        3
South Asia                 Low income         2
Sub-Saharan Africa         High income        1
                           Low income        27